name: "gpt_example"
backend: "lightseq"
max_batch_size: 8
input [
  {
    name: "token_ids"
    data_type: TYPE_INT32
    dims: [ -1 ]
  }
]
output [
  {
    name: "result"
    data_type: TYPE_INT32
    dims: [ -1 ]
  }
]
instance_group [
  {
    count: 1
    kind: KIND_CPU
  }
]
default_model_filename: "lightseq_gpt2_base.hdf5"
parameters: [
    {
        key: "model_type"
        value: {
            string_value: "Gpt"
        }
    }
]
version_policy: {
    specific: {
        versions: [2]
    }
}
